module.exports.config = {
 name: "rules2",
 version: "1.0.0",
 hasPermssion: 0,
 credits: "Shahadat Islam",
 description: "Send group rules",
 commandCategory: "information",
 usages: "rules2",
 cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
 const message = `❐-আসসালামু আলাইকুম,🖤🌺
❐- 𝙶𝚁𝙾𝚄𝙿 এর কিছু 𝚁𝚄𝙻𝙴𝚂 আছে, এগুলো হয়তো অনেকেই জানেন না যারা জানেন না তারা জেনে রাখেন⬅️
<------------------------------------------------->

🕋 [১] যেহেতু এটি একটি ইসলামিক গ্রুপ, তাই কোনো প্রকার খারাপ ভাষা ব্যবহার করা যাবে না

🕋 [২] পর্ণোগ্রাফি কিংবা অশ্লীল ভিডিও দেওয়া যাবে না

🕋 [৩] ইসলামিক গ্রুপে থাকার জন্য আল্লাহর শুকরিয়া করুন এবং সবাইকে সম্মান দিন

🕋 [৪] বড় কিংবা ছোট কাউকে ছোট করে কথা বলা যাবে না

🕋 [৫] এখানে ইসলামের বাইরে কোনো কথা বলা যাবে না

🕋 [৬] এডমিন অনেক কষ্ট করে গ্রুপ ও রোবট বানিয়েছে, এডমিনকে সম্মান করুন

🕋 [৭] বট সম্পর্কিত কোনো সমস্যা থাকলে এডমিনকে ইনবক্স করুন

🕋 [৮] এখানে ঝগড়া করা সম্পূর্ণ নিষেধ

🕋 [৯] এই গ্রুপে ইসলামিক রোবট ছাড়া অন্য কোনো রোবট অ্যাড করা যাবে না

🕋 [১০] ১৮+ কন্টেন্ট নিয়ে আলোচনা করলে সাথে সাথে গ্রুপ থেকে বের করে দেওয়া হবে

🕋 [১১] সকল ধর্মের লোক এখানে থাকতে পারবে, কিন্তু কারো ধর্ম নিয়ে কাউকে ছোট করা যাবে না

🕋 [১২] একই ইমোজি বার বার পাঠানো থেকে বিরত থাকুন

🕋 [১৩] এডমিনের অনুমতি ছাড়া গ্রুপের নাম বা স্ট্যাটাস পরিবর্তন করা যাবে না

🕋 [১৪] গ্রুপে কোনো স্প্যাম মেসেজ করা যাবে না

🕋 [১৫] গ্রুপে কোনো ফিশিং লিংক বা ক্ষতিকর লিংক দেওয়া যাবে না

<------------------------------------------------->
❖ কারও সমস্যা থাকলে সরাসরি 𝙰𝙳𝙼𝙸𝙽𝚂 দের ইনবক্স করুন 💌
❖ রুলস ভাঙলে আগে ওয়ার্নিং, পরে অ্যাকশন 😈

𝙱𝙾𝚃 𝙰𝙳𝙼𝙸𝙽: 𝗥𝗮𝗻𝗮 𝐈𝐬𝐥𝐚𝐦
𝙵𝙱 𝙻𝙸𝙽𝙺: https://www.facebook.com/profile.php?id=100042211012809

_সাথেই থাকুন 🌺─꯭─⃝‌‌𝗥𝗮𝗻𝗮 𝐂𝐡𝐚𝐭 𝐁𝐨𝐭🌸_

💖...........ধন্যবাদ সবাইকে...........💖`;

 return api.sendMessage(message, event.threadID);
};
